// 4) შექმენით ფუნქცია სახელად filter, ფუნქციას ექნება ერთიუ პარამეტრი სახელად numbers, ეს პარამეტრი მიიიღებს რიცხვების მასივს, ფუნქციაში შექმენით თავიდან ერთი ცარიელი მასივი სახელად filteredArr რომელშიც დაამატებთ მხოლოდ იმ რიცხვებს რომლებიც იყოფა ნულზე, გამოიყენეთ  for ციკლი ამისათვის, საბოლოოდ როცა დაამატებთ ყვბელა ლუწ რიცხვს დააბრუნეთ ფუნქციიდან return იტ და დაბეჭდეთ დაბრუნებული მასივი

let list = [2, 4, 6, 85, 4, 4, 3, 1]

function evenOrOdd(number){
    let empty = []
    for(let i of number){
        if(i % 2 == 0){
            empty.push(i)
        };
    }
    return empty
}

console.log(evenOrOdd(list));
